Emacs/emacs-lisp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Emacs-Lisp</title>
<!-- 2016-05-01 Sun 12:03 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="ChrisChen" />
<meta  name="keywords" content="emacs, Elisp" />
<link rel="stylesheet" type="text/css" href="../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Emacs-Lisp</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. veriable</a>
<ul>
<li><a href="#sec-1-1">1.1. setq = set '</a></li>
<li><a href="#sec-1-2">1.2. incrementer</a></li>
</ul>
</li>
<li><a href="#sec-2">2. function</a>
<ul>
<li><a href="#sec-2-1">2.1. The defun Special Form</a></li>
<li><a href="#sec-2-2">2.2. let</a></li>
<li><a href="#sec-2-3">2.3. if</a></li>
<li><a href="#sec-2-4">2.4. save-excursion</a></li>
<li><a href="#sec-2-5">2.5. Common function</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Tags</a>
<ul>
<li><a href="#sec-3-1">3.1. M-x visit-tags-table command and specify a TAG path</a></li>
<li><a href="#sec-3-2">3.2. M-x compile RET etags *.el RET</a></li>
<li><a href="#sec-3-3">3.3. M-. [fuctionName]</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Two meanings of nil</a></li>
<li><a href="#sec-5">5. lookup a complete list of veriable and function by keyword</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> veriable</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> setq = set '</h3>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> incrementer</h3>
<div class="outline-text-3" id="text-1-2">
<p>
(setq counter 0)            ; Let's call this the initializer.
(setq counter (+ counter 1))    ; This is the incrementer.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> function</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> The defun Special Form</h3>
<div class="outline-text-3" id="text-2-1">
</div><ol class="org-ol"><li><a id="sec-2-1-1" name="sec-2-1-1"></a>description<br  /><ul class="org-ul"><li><a id="sec-2-1-1-1" name="sec-2-1-1-1"></a>The name of the symbol to which the function definition should be attached.<br  /></li>
<li><a id="sec-2-1-1-2" name="sec-2-1-1-2"></a>A list of the arguments that will be passed to the function. If no arguments will be passed to the function, this is an empty list, ().<br  /></li>
<li><a id="sec-2-1-1-3" name="sec-2-1-1-3"></a>Documentation describing the function. (Technically optional, but strongly recommended.)<br  /></li>
<li><a id="sec-2-1-1-4" name="sec-2-1-1-4"></a>Optionally, an expression to make the function interactive so you can use it by typing M-x and then the name of the function; or by typing an appropriate key or keychord.<br  /></li>
<li><a id="sec-2-1-1-5" name="sec-2-1-1-5"></a>The code that instructs the computer what to do: the body of the function definition.<br  /></li></ul>
</li>

<li><a id="sec-2-1-2" name="sec-2-1-2"></a>definition<br  /><div class="outline-text-4" id="text-2-1-2">
<p>
(defun function-name (arguments&#x2026;)
  "optional-documentation&#x2026;"
  (interactive argument-passing-info)     ; optional
  body&#x2026;)
</p>
</div>
</li>

<li><a id="sec-2-1-3" name="sec-2-1-3"></a>example<br  /><div class="outline-text-4" id="text-2-1-3">
<p>
(defun multiply-by-seven (number)
  "Multiply NUMBER by seven."
  (interactive "p")                             ;using the prefix argument
  (message "The result is %d" (* 7 number)))
</p>
</div>
</li>

<li><a id="sec-2-1-4" name="sec-2-1-4"></a>interactive parameter<br  /><div class="outline-text-4" id="text-2-1-4">
<p>
b
The name of an existing buffer.
f
The name of an existing file.
p
The numeric prefix argument. (Note that this `p' is lower case.)
r
Point and the mark, as two numeric arguments, smallest first. This is the only code letter that specifies two successive arguments rather than one.
</p>
</div>
</li></ol>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> let</h3>
<div class="outline-text-3" id="text-2-2">
</div><ol class="org-ol"><li><a id="sec-2-2-1" name="sec-2-2-1"></a>definition<br  /><div class="outline-text-4" id="text-2-2-1">
<p>
(let ((variable value)(variable value)) body&#x2026;)
</p>
</div>
</li>
<li><a id="sec-2-2-2" name="sec-2-2-2"></a>example<br  /><div class="outline-text-4" id="text-2-2-2">
<p>
(let ((zebra 'stripes)
       (tiger 'fierce))
   (message "One kind of animal has %s and another is %s."
            zebra tiger))
</p>
</div>
</li></ol>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> if</h3>
<div class="outline-text-3" id="text-2-3">
</div><ol class="org-ol"><li><a id="sec-2-3-1" name="sec-2-3-1"></a>definition<br  /><div class="outline-text-4" id="text-2-3-1">
<p>
(if true-or-false-test
    action-to-carry-out-if-test-is-true)
</p>

<p>
(if true-or-false-test
    action-to-carry-out-if-the-test-returns-true
  action-to-carry-out-if-the-test-returns-false)
</p>
</div>
</li>
<li><a id="sec-2-3-2" name="sec-2-3-2"></a>example<br  /><div class="outline-text-4" id="text-2-3-2">
<p>
(if (&gt; 5 4)                             ; if-part
    (message "5 is greater than 4!"))   ; then-part
</p>

<p>
(if (&gt; 4 5)                               ; if-part
    (message "4 falsely greater than 5!") ; then-part
  (message "4 is not greater than 5!"))   ; else-part
</p>
</div>
</li>

<li><a id="sec-2-3-3" name="sec-2-3-3"></a>true &amp; false<br  /><div class="outline-text-4" id="text-2-3-3">
<p>
false is nil
true is anything else
</p>
</div>
</li></ol>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> save-excursion</h3>
<div class="outline-text-3" id="text-2-4">
<p>
saves the location of point and mark.
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #DCDCCC;">(</span>message <span style="color: #CC9393;">"We are %d characters into this buffer."</span>
    <span style="color: #BFEBBF;">(</span>- <span style="color: #D0BF8F;">(</span>point<span style="color: #D0BF8F;">)</span>
        <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">save-excursion</span>
            <span style="color: #93E0E3;">(</span>goto-char <span style="color: #9FC59F;">(</span>point-min<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span> <span style="color: #93E0E3;">(</span>point<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> Common function</h3>
<div class="outline-text-3" id="text-2-5">
<ul class="org-ul">
<li>message:
</li>
</ul>
<p class="verse">
Print a message in the echo area. The first argument is a string that can contain ‘%s’, ‘%d’,<br  />
or ‘%c’ to print the value of arguments that follow the string. The argument used by ‘%s’ must<br  />
be a string or a symbol; the argument used by ‘%d’ must be a number. The argument used by<br  />
‘%c’ must be an ascii code number; it will be printed as the character with that ascii code.<br  />
(Various other %-sequences have not been mentioned.)<br  />
</p>
<ul class="org-ul">
<li>buffer-name:
Without an argument, return the name of the buffer, as a string.
</li>
<li>buffer-file-name:
Without an argument, return the name of the file the buffer is visiting.
</li>
<li>current-buffer:
Return the buffer in which Emacs is active; it may not be the buffer that is visible on the screen.
</li>
<li>other-buffer:
Return the most recently selected buffer (other than the buffer passed to other-buffer as an argument and other than the current buffer).
</li>
<li>switch-to-buffer:
Select a buffer for Emacs to be active in and display it in the current window so users can look at it. Usually bound to C-x b.
</li>
<li>set-buffer:
Switch Emacs' attention to a buffer on which programs will run. Don't alter what the window is showing.
</li>
<li>buffer-size:
Return the number of characters in the current buffer.
</li>
<li>point:
Return the value of the current position of the cursor, as an integer counting the number of characters from the beginning of the buffer.
</li>
<li>point-min:
Return the minimum permissible value of point in the current buffer. This is 1, unless narrowing is in effect.
</li>
<li>point-max:
Return the value of the maximum permissible value of point in the current buffer. This is the end of the buffer, unless narrowing is in effect.
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Tags</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> M-x visit-tags-table command and specify a TAG path</h3>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> M-x compile RET etags *.el RET</h3>
</div>
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> M-. [fuctionName]</h3>
<div class="outline-text-3" id="text-3-3">
<p>
will go to the function definition in src
</p>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Two meanings of nil</h2>
<div class="outline-text-2" id="text-4">
</div><ol class="org-ol"><li><a id="sec-4-0-1" name="sec-4-0-1"></a>the empty list.<br  /><div class="outline-text-4" id="text-4-0-1">
<p>
() nil  &lt;= same thing
</p>
</div>
</li>
<li><a id="sec-4-0-2" name="sec-4-0-2"></a>false<br  /></li></ol>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> lookup a complete list of veriable and function by keyword</h2>
<div class="outline-text-2" id="text-5">
<p>
M-x apropos RET keyword RET
</p>
</div>
</div>
</div>
</body>
</html>
